# Homebrew Tap 추가
#tap "homebrew/cask"            ## 더 이상 별도로 탭할 필요가 없으며, --force 옵션을 추가해야 합니다.
tap "homebrew/cask-fonts"       ## 이 저장소는 더 이상 사용되지 않으며, 모든 폰트는 homebrew/cask로 이전되었습니다.
tap "homebrew/core"             ## 기본적으로 포함되어 있으므로 별도로 탭할 필요가 없습니다.

# 필수 CLI 도구
brew "git"                       # Git 버전 관리 도구
brew "zsh"                       # Zsh 쉘
brew "tmux"                      # 터미널 멀티플렉서
brew "htop"                      # 시스템 모니터링 도구
brew "wget"                      # 파일 다운로드 도구
brew "curl"                      # 데이터 전송 도구
brew "fzf"                       # 터미널에서 검색 지원

# 개발 환경 관련 도구
brew "node"                      # Node.js
brew "python@3.12" 	             # Python 버전 업데이트
brew "openjdk"                   # Java Development Kit
  #brew "rust"       		           # Rust 언어 추가

# 유용한 CLI 유틸리티
brew "bat"                       # cat 명령어 대체 (하이라이트 지원)
brew "jq"                        # JSON 처리 도구
brew "tree"                      # 디렉토리 구조 보기
brew "autojump"                  # 디렉토리 빠른 이동
brew "ripgrep"                   # 고속 검색 도구 추가

# GUI 애플리케이션 (Cask)
cask "google-chrome"             # 구글 크롬 브라우저
cask "zen-browser"	             ##zen browser
cask "visual-studio-code"        # VS Code 에디터
  #cask "slack"                     # 슬랙 메신저
cask "iterm2"                    # iTerm2 터미널
cask "docker"                    # Docker 데스크톱 앱
cask "rectangle"   		           # 창 관리 도구 (Magnet 대체)
cask "topnotch"	               	 ##탑노치
cask "bitwarden"		             ##bitwarden
cask "menubarx"		               ##MenubarX
cask "hiddenbar"		             ##hiddenbar
cask "keka"		                   ##keka
cask "shottr"		                 ##shottr - 설정 필요
cask "microsoft-excel"	         ##MS-excel
cask "microsoft-powerpoint"	     ##MS-PP
cask "microsoft-word"	           ##MS-Word
cask "figma"		                 ##figma
cask "obsidian"		               ##obsidian
cask "maccy"                     ##maccy
cask "cursor"		                 ##Cursor AI
cask "telegram-desktop"          ##텔레그램 메신저

# App Store 프로그램 (MAS)
mas "Xcode", id: 497799835       # Xcode (앱스토어 ID 필요)
mas "KakaoTalk", id: 869223134	 ##kakaotalk
mas "LINE", id: 539883307		     ##line
mas "Keynote", id: 409183694  	 ##Keynote
mas "Jolt of Caffeine", id: 1437130425	##jolt of caffeine
mas "RunCat", id: 1429033973	   ##RunCat
mas "Folder Hub - File Browser", id: 6473019059	##Folder hub
mas "Windows App", id: 1295203466	##Windows app


# 폰트 추가 (Cask Fonts)
cask "font-jetbrains-mono-nerd-font"  # 최신 인기 개발자 폰트
