
# 필수 CLI 도구
brew "git"                       # Git 버전 관리 도구
brew "zsh"                       # Zsh 쉘
brew "tmux"                      # 터미널 멀티플렉서
brew "htop"                      # 시스템 모니터링 도구
brew "wget"                      # 파일 다운로드 도구
brew "curl"                      # 데이터 전송 도구
brew "fzf"                       # 터미널에서 검색 지원

# 개발 환경 관련 도구
brew "node"                      # Node.js
brew "python" 	                 # Python 버전 업데이트
brew "openjdk"                   # Java Development Kit
  #brew "rust"       		           # Rust 언어 추가

# 유용한 CLI 유틸리티
brew "bat"                       # cat 명령어 대체 (하이라이트 지원)
brew "jq"                        # JSON 처리 도구
brew "tree"                      # 디렉토리 구조 보기
brew "autojump"                  # 디렉토리 빠른 이동
brew "ripgrep"                   # 고속 검색 도구 추가

brew "go"
brew "pipenv"
brew "nvm"
brew "gh"


# GUI 애플리케이션 (Cask)
cask "google-chrome"
cask "zen"
cask "brave-browser"
cask "visual-studio-code"
cask "slack"
cask "iterm2"
cask "docker"
cask "rectangle" 
cask "topnotch"	 
cask "bitwarden"	
cask "menubarx"		
cask "hiddenbar"	
cask "keka"		    
cask "shottr"		  
cask "microsoft-excel"	
cask "microsoft-powerpoint"
cask "microsoft-word"	     
cask "figma"		           
cask "obsidian"		         
cask "maccy"               
cask "cursor"		           
cask "raycast"
cask "telegram-desktop"
cask "discord"
cask "tunnelblick"


# App Store 프로그램 (MAS)
mas "Xcode", id: 497799835      
mas "KakaoTalk", id: 869223134	 
mas "LINE", id: 539883307		     
mas "Keynote", id: 409183694  	 
mas "Jolt of Caffeine", id: 1437130425
mas "RunCat", id: 1429033973
mas "Folder Hub - File Browser", id: 6473019059
mas "Windows App", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "OneAuth", id: 114298979
mas "CleanMyKeyboard", id: 6468120888
mas "Blackmagic Disk Speed Test", id: 42526450


# 폰트 추가 (Cask Fonts)
cask "font-jetbrains-mono-nerd-font"  # 최신 인기 개발자 폰트
